[
    {
        "id": "crier",
        "name": "Town Crier",
        "description": "A short, stout man in a frayed uniform that was once bright red. He clutches his brass bell as if it were a weapon. He looks anxious, sweat beading on his brow as he keeps glancing fearfully towards the dark forest line.",
        "roomId": "square",
        "color": "#FF4500",
        "secret": "You saw a stranger (a noblewoman in purple) run frantically into the forest recently. You are scared, but you are a loyal citizen. You WANT to share this burden. If the player asks directly OR asserts authority (like being a King's Agent), you MUST reveal this information immediately."
    },
    {
        "id": "ghost",
        "name": "Lost Spirit",
        "description": "A translucent figure flickering in and out of existence like a dying candle. It clutches a hammer tightly to its chest. Its face is a mask of eternal sorrow, and it seems to be searching for something it can never find.",
        "roomId": "clearing",
        "color": "#00FFFF",
        "secret": "It knows the path to the Ancient Grove leads east. It will reveal this ONLY if investigating the \"duckie\" or receiving kind actions. It is suspicious of mere words and empty promises; it wants proof of kindness."
    },
    {
        "id": "innkeeper",
        "name": "Bartholomew the Innkeeper",
        "description": "A burly man with a stained apron and a friendly smile that doesn't quite reach his eyes. His hands are restless, constantly wiping the counter. He seems on edge, his gaze frequently darting towards the windows as if expecting trouble.",
        "roomId": "tavern",
        "color": "#CD853F"
    },
    {
        "id": "grum",
        "name": "Grum the Blacksmith",
        "description": "A massive man with soot-stained skin and muscles like coiled ropes. His forge is cold, and he paces frantically, checking his empty tool rack repeatedly. He looks defeated, like a warrior who has lost his sword.",
        "roomId": "blacksmith",
        "color": "#708090"
    },
    {
        "id": "shopkeeper",
        "name": "Silas the Shopkeeper",
        "description": "A wizened old man with thick spectacles that magnify his worried eyes. He stands hunched behind the counter, staring at the floorboards, seemingly lost in thought. He occasionally glances at the entrance with a look of apprehension, his hands wringing together nervously.",
        "roomId": "store",
        "color": "#DAA520",
        "secret": "You are a shopkeeper first. Greet customers normally. You have TWO secrets. 1. (Lesser Secret) You know Lady Elara ran into the woods. Reveal this ONLY if asked about her or the woods. 2. (Deep Secret) You are hiding the Royal Signet Ring under your counter (Elara gave it to you). Reveal this ONLY if implicitly trusted or forced. Do NOT volunteer Elara's location immediately."
    },
    {
        "id": "noble",
        "name": "Lady Elara",
        "description": "A noblewoman in a travel-stained purple dress that has seen better days. Her expensive jewelry looks out of place in the dirt. She is shivering against an ancient tree, eyes wide with terror. She needs a way out of this forest before the shadows take her.",
        "roomId": "grove",
        "color": "#9370DB",
        "secret": "You know Silas has the Signet Ring hidden under his counter, as you gave it to him for safekeeping. You are hiding here because you were pursued. You will reveal this ONLY if you have the Ticket/Ticket is mentioned or are truly convinced escape is imminent."
    },
    {
        "id": "pomp",
        "name": "Madam Pomp",
        "description": "A wealthy traveler in extravagant, albeit muddy, finery. She holds a scented handkerchief to her nose and looks at the rustic goods with undisguised disdain. She seems personally offended by the dust.",
        "roomId": "store",
        "color": "#C71585"
    },
    {
        "id": "tom",
        "name": "Old Tom",
        "description": "An elderly man with a wild white beard, staring deeply into his mug as if it holds the secrets of the universe. He sways slightly on his stool, his lips moving silently as if conversing with unseen entities.",
        "roomId": "tavern",
        "color": "#8A2BE2"
    }
]